Управление_торговлей.ПБТ/src/Documents/СменноеЗадание/СменноеЗадание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменноеЗадание</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазбивкаПоДням</types>
    </type>
  </attributes>
  <attributes>
    <name>УжеБылПроведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлановое</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.Линии</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемЗамеса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Рецепт</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>СтерилизуемыеПродукты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Documents/СменноеЗадание/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПечатьСЗНаСервере()
	Возврат Документы.СменноеЗадание.ПечатьСЗ(Объект);
КонецФункции

&НаКлиенте
Процедура ПечатьСЗ(Команда)
	ТабДок = ПечатьСЗНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРазбивкеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли; 
	
	Основание = Объект.ДокументОснование;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	Организация = Основание.Организация;
	Объект.Продукция.Очистить();
	
	Комментарий = Основание.Комментарий; 
	ИмяРеквизита = "Колич"+ДеньНедели(Объект.Дата); 
	Если Основание.Метаданные().ТабличныеЧасти.Продукция.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Надо выбрать рабочий день!");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	
	Для каждого Стр Из Основание.Продукция Цикл
		Если ЗначениеЗаполнено(Стр[ИмяРеквизита]) Тогда
			НовСтр = Объект.Продукция.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			НовСтр.КоличествоПлановое = Стр[ИмяРеквизита];
			НовСтр.Рецепт = Стр.Рецепт; //РасчетРецептур.ПолучитьТекущийРецепт(НовСтр.Номенклатура, НовСтр.ХарактеристикаНоменклатуры);  
			НовСтр.Линия = Стр.Линия;
			НовСтр.ОбъемЗамеса = Стр.Линия.Мощность;
			НовСтр.Примечание = Стр.КомментарийСтр;
			
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРазбивке(Команда)
	
	ЗаполнитьПоРазбивкеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПродукцияЛинияПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияЛинияПриИзменении(Элемент)
	ПродукцияЛинияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры
